Artilleryfile.yml
config:
  target: 'http://localhost:3000/'
  #Descomentar cuando se habilite el login
  payload:
    path: "users.csv" 
    fields:
        - "username"
        - "password"
  http:
    tls:
      rejectUnauthorized: false
  phases:
    - duration: 50
      arrivalRate: 0
      rampTo: 49
      name: "Initial test with ascending number of calls per second"
    - duration: 60
      arrivalRate: 20
      name: "Sustained very big load" 
scenarios:
  - flow:
      - log: "Make login in system"
      - post:
            url: "/auth"
            json:
              username: "{{ username }}"
              password: "{{ password }}"
      - get:
            url: "/"
      - get:
            url: "/problems/student"
    - get:
        url: "/"
    - get:
        url: "/problems/student"